emacs/.config/emacs/iron-emacs.el

(use-package general
  :ensure t
  :config
  (general-evil-setup)

  ;; set up 'SPC' as the global leader key
  (general-create-definer iron/leader-keys
    :states '(normal insert visual emacs)
    :keymaps 'override
    :prefix "SPC" ;; set leader
    :global-prefix "M-SPC") ;; access leader in insert mode
  
  (iron/leader-keys
    "SPC" '(counsel-M-x :wk "Counsel M-x")
    "." '(find-file :wk "Find file")
    "=" '(perspective-map :wk "Perspective") ;; Lists all the perspective keybindings
    "TAB TAB" '(comment-line :wk "Comment lines")
    "u" '(universal-argument :wk "Universal argument"))

  (iron/leader-keys
    "b" '(:ignore t :wk "[B]uffer")
    "b c" '(clone-indirect-buffer :wk "Create indirect buffer [C]opy in a split")
    "b C" '(clone-indirect-buffer-other-window :wk "[C]lone indirect buffer in new window")
    "b d" '(bookmark-delete :wk "Delete bookmark")
    "b i" '(ibuffer :wk "[I]buffer")
    "b k" '(kill-this-buffer :wk "[K]ill this buffer")
    "b K" '(kill-some-buffers :wk "[K]ill multiple buffers")
    "b l" '(list-bookmarks :wk "[L]ist bookmarks")
    "b m" '(bookmark-set :wk "Set book[M]ark")
    "b n" '(next-buffer :wk "[N]ext buffer")
    "b p" '(previous-buffer :wk "[P]revious buffer")
    "b r" '(revert-buffer :wk "[R]eload buffer")
    "b R" '(rename-buffer :wk "[R]ename buffer")
    "b s" '(basic-save-buffer :wk "[S]ave buffer")
    "b S" '(save-some-buffers :wk "[S]ave multiple buffers")
    "b w" '(bookmark-save :wk "[W]rite/Save current bookmarks to bookmark file"))
  
  (iron/leader-keys
    "d" '(:ignore t :wk "[D]ired")
    "d d" '(dired :wk "Open [D]ired")
    "d j" '(dired-jump :wk "Dired [J]ump to current")
    "d n" '(neotree-dir :wk "Open directory in [N]eotree")
    "d p" '(peep-dired :wk "Peep-dired"))
  
  (iron/leader-keys
    "e" '(:ignore t :wk "[E]shell/[E]valuate")    
    "e b" '(eval-buffer :wk "Evaluate elisp in [B]uffer")
    "e d" '(eval-defun :wk "Evaluate [D]efun containing or after point")
    "e e" '(eval-expression :wk "Evaluate and elisp [E]xpression")
    "e h" '(counsel-esh-history :wk "Eshell [H]istory")
    "e l" '(eval-last-sexp :wk "Evaluate [L]ast elisp expression before point")
    "e r" '(eval-region :wk "Evaluate elisp in [R]egion")
    "e R" '(eww-reload :which-key "[R]eload current page in EWW")
    "e s" '(eshell :wk "E[S]hell")
    "e w" '(eww :wk "EWW emacs [W]eb browser"))

  (iron/leader-keys
    "f" '(:ignore t :wk "[F]iles")
    "f c" '((lambda () (interactive) 
	      (find-file "~/.config/emacs/iron-emacs.org")) 
	    :wk "[F]ind emacs [C]onfig")
    "f e" '((lambda () (interactive)
	      (dired "~/.config/emacs/"))
	    :wk "Open user-[E]macs-directory in dired")
    "f d" '(find-grep-dired :wk "Search for string in files in [D]IR")
    "f g" '(counsel-grep-or-swiper :wk "[G]rep for string in current file")
    "f i" '((lambda () (interactive)
	      (find-file "~/.config/emacs/init.el"))
	    :wk "Open emacs [I]nit.el")
    "f j" '(counsel-file-jump :wk "[J]ump to a file below current directory")
    "f l" '(counsel-locate :wk "[L]ocate a file")
    "f r" '(counsel-recentf :wk "Find [R]ecent files")
    "f u" '(sudo-edit-find-file :wk "S[U]do find file")
    "f U" '(sudo-edit :wk "S[U]do edit file"))
  
  (iron/leader-keys
    "g" '(:ignore t :wk "[G]it")    
    "g /" '(magit-displatch :wk "Magit dispatch [/]")
    "g ." '(magit-file-displatch :wk "Magit file dispatch [.]")
    "g b" '(magit-branch-checkout :wk "Switch [B]ranch")
    "g c" '(:ignore t :wk "[C]reate") 
    "g c b" '(magit-branch-and-checkout :wk "Create [B]ranch and checkout")
    "g c c" '(magit-commit-create :wk "Create [C]ommit")
    "g c f" '(magit-commit-fixup :wk "Create [F]ixup commit")
    "g C" '(magit-clone :wk "[C]lone repo")
    "g f" '(:ignore t :wk "[F]ind") 
    "g f c" '(magit-show-commit :wk "Show [C]ommit")
    "g f f" '(magit-find-file :wk "Magit find [F]ile")
    "g f g" '(magit-find-git-config-file :wk "Find [G]itconfig file")
    "g F" '(magit-fetch :wk "Git [F]etch")
    "g g" '(magit-status :wk "Ma[G]it status")
    "g i" '(magit-init :wk "[I]nitialize git repo")
    "g l" '(magit-log-buffer-file :wk "Magit buffer [L]og")
    "g r" '(vc-revert :wk "Git [R]evert file")
    "g s" '(magit-stage-file :wk "Git [S]tage file")
    "g t" '(git-timemachine :wk "Git [T]ime machine")
    "g u" '(magit-stage-file :wk "Git [U]nstage file"))

  (iron/leader-keys
    "h" '(:ignore t :wk "[H]elp")  
    "h a" '(counsel-apropos :wk "[A]propos")
    "h b" '(describe-bindings :wk "Describe [B]indings")
    "h c" '(describe-char :wk "Describe [C]haracter under cursor")
    "h d" '(:ignore t :wk "Emacs [D]ocumentation")
    "h d a" '(about-emacs :wk "[A]bout Emacs")
    "h d d" '(view-emacs-debugging :wk "View Emacs [D]ebugging")
    "h d f" '(view-emacs-FAQ :wk "View Emacs [F]AQ")
    "h d m" '(info-emacs-manual :wk "The Emacs [M]anual") 
    "h d n" '(view-emacs-news :wk "View Emacs [N]ews")
    "h d o" '(describe-distribution :wk "How to [O]btain Emacs")
    "h d p" '(view-emacs-problems :wk "View Emacs [P]roblems")
    "h d t" '(view-emacs-todo :wk "View Emacs [T]odo")
    "h d w" '(describe-no-warranty :wk "Describe no [W]arranty")
    "h e" '(view-echo-area-messages :wk "View [E]cho area messages")
    "h f" '(describe-function :wk "Describe [F]unction")
    "h F" '(describe-face :wk "Describe [F]ace")
    "h g" '(describe-gnu-project :wk "Describe [G]NU Project")
    "h i" '(info :wk "[I]nfo")
    "h I" '(describe-input-method :wk "Describe [I]nput method")
    "h k" '(describe-key :wk "Describe [K]ey")
    "h l" '(view-lossage :wk "Display recent keystrokes and the commands run")
    "h L" '(describe-language-environment :wk "Describe [L]anguage environment")
    "h m" '(describe-mode :wk "Describe [M]ode")
    "h r" '(:ignore t :wk "[R]eload")
    "h r r" '((lambda () (interactive)
		(load-file "~/.config/emacs/init.el")
		(ignore (elpaca-process-queues)))
              :wk "Reload emacs config")
    "h t" '(load-theme :wk "Load [T]heme")
    "h v" '(describe-variable :wk "Describe [V]ariable")
    "h w" '(where-is :wk "Prints keybinding for command if set")
    "h x" '(describe-command :wk "Display full documentation for command"))
 
 (iron/leader-keys
    "m" '(:ignore t :wk "Org")
    "m a" '(org-agenda :wk "Org [A]genda")
    "m e" '(org-export-dispatch :wk "Org [E]xport dispatch")
    "m i" '(org-toggle-item :wk "Org toggle [I]tem")
    "m t" '(org-todo :wk "Org [T]odo")
    "m B" '(org-babel-tangle :wk "Org [B]abel tangle")
    "m T" '(org-todo-list :wk "Org [T]odo list"))

 (iron/leader-keys
    "m b" '(:ignore t :wk "Tables")
    "m b -" '(org-table-insert-hline :wk "Insert hline in table"))

 (iron/leader-keys
    "m d" '(:ignore t :wk "Date/deadline")
    "m d t" '(org-time-stamp :wk "Org time stamp"))

 (iron/leader-keys
    "o" '(:ignore t :wk "[O]pen")
    "o d" '(dashboard-open :wk "[D]ashboard")
    "o e" '(elfeed :wk "[E]lfeed RSS")
    "o f" '(make-frame :wk "Open buffer in new [F]rame")
    "o F" '(select-frame-by-name :wk "Select [F]rame by name"))

 (iron/leader-keys
    "p" '(projectile-command-map :wk "[P]rojectile"))

 (iron/leader-keys
    "s" '(:ignore t :wk "[S]earch")
    "s d" '(dictionary-search :wk "Search [D]ictionary")
    "s m" '(man :wk "[M]an pages")
    "s t" '(tldr :wk "Lookup [T]LDR docs for a command")
    "s w" '(woman :wk "[W]oman pages: similar to man but doesn't require man"))

 (iron/leader-keys
    "t" '(:ignore t :wk "[T]oggle")
    "t e" '(eshell-toggle :wk "Toggle [E]shell")
    "t f" '(flycheck-mode :wk "Toggle [F]lycheck")
    "t l" '(display-line-numbers-mode :wk "Toggle [L]ine numbers")
    "t n" '(neotree-toggle :wk "Toggle [N]eotree file viewer")
    "t o" '(org-mode :wk "Toggle [O]rg mode")
    "t r" '(rainbow-mode :wk "Toggle [R]ainbow mode")
    "t t" '(visual-line-mode :wk "Toggle [T]runcated lines")
    "t v" '(vterm-toggle :wk "Toggle [V]term"))

 (iron/leader-keys
    "w" '(:ignore t :wk "[W]indows")
    ;; Window splits
    "w c" '(evil-window-delete :wk "[C]lose window")
    "w n" '(evil-window-new :wk "[N]ew window")
    "w s" '(evil-window-split :wk "Horizontal [S]plit window")
    "w v" '(evil-window-vsplit :wk "[V]ertical split window")
    ;; Window motions
    "w h" '(evil-window-left :wk "Window left [H]")
    "w j" '(evil-window-down :wk "Window down [J]")
    "w k" '(evil-window-up :wk "Window up [K]")
    "w l" '(evil-window-right :wk "Window right [L]")
    "w w" '(evil-window-next :wk "Goto next [W]indow")
    ;; Move Windows
    "w H" '(buf-move-left :wk "Buffer move left [H]")
    "w J" '(buf-move-down :wk "Buffer move down [J]")
    "w K" '(buf-move-up :wk "Buffer move up [K]")
    "w L" '(buf-move-right :wk "Buffer move right [L]"))
)
